Revit 2024 API
DockablePaneProviderData Methods
The DockablePaneProviderData type exposes the following members.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFrameworkElement
 Wrapper function that returns the FrameworkElement for this provider.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DockablePaneProviderData Class
Autodesk.Revit.UI Namespace